app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:name)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."name" ASC

  def show
    id = params[:id]
    @task = Task.find_by(id: id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "j"], ["description", "sdafasdf"], ["created_at", "2018-09-20 00:12:48.924753"], ["updated_at", "2018-09-20 00:12:48.924753"]]

  def edit
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id].to_i)
    @task.name = params[:task][:name]
    @task.description = params[:task][:description]
    if @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Eat leftover cake."], ["updated_at", "2018-09-20 01:08:08.521127"], ["id", 15]]

    task = Task.find_by(id: id)
    if task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]

  def mark_complete
    id = params[:id]
    @task = Task.find_by(id: id)

    if @task.completion_date == nil
      @task.update(completion_date: Date.today)
    else
      @task.update(completion_date: nil)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-19"], ["updated_at", "2018-09-20 01:03:15.913958"], ["id", 15]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-20 01:03:13.507348"], ["id", 15]]